ДО_для_разработки/src/Catalogs/ДелегированиеПрав/ДелегированиеПрав.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДелегированиеПрав</name>
  <basedOn>Document.Отсутствие</basedOn>
  <attributes>
    <name>ВариантДелегирования</name>
    <type>
      <types>EnumRef.ВариантыДелегированияПрав</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кому</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтКого</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаПередачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбластиДелегирования</name>
    <attributes>
      <name>ОбластьДелегирования</name>
      <type>
        <types>CatalogRef.ОбластиДелегированияПрав</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьРоли</name>
    <attributes>
      <name>РольИсполнителя</name>
      <type>
        <types>CatalogRef.РолиИсполнителей</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнойОбъектАдресации</name>
      <type>
        <types>Characteristic.ОбъектыАдресацииЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйОбъектАдресации</name>
      <type>
        <types>Characteristic.ОбъектыАдресацииЗадач</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ДО_для_разработки/src/Enums/ВариантыДелегированияПрав/ВариантыДелегированияПрав.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыДелегированияПрав</name>
  <enumValues>
    <name>ВсеПрава</name>
  </enumValues>
  <enumValues>
    <name>Выборочно</name>
  </enumValues>
</mdclass:Enum>

ДО_для_разработки/src/Catalogs/ОбластиДелегированияПрав/ОбластиДелегированияПрав.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбластиДелегированияПрав</name>
  <predefined>
    <items>
      <name>ДокументыИФайлы</name>
      <description>Документы и файлы</description>
    </items>
    <items>
      <name>ЕжедневныеОтчеты</name>
      <description>Ежедневные отчеты</description>
    </items>
    <items>
      <name>Календарь</name>
      <description>Календарь</description>
    </items>
    <items>
      <name>Контроль</name>
      <description>Контроль</description>
    </items>
    <items>
      <name>Мероприятия</name>
      <description>Мероприятия</description>
    </items>
    <items>
      <name>Обсуждения</name>
      <description>Обсуждения</description>
    </items>
    <items>
      <name>Почта</name>
      <description>Почта</description>
    </items>
    <items>
      <name>Проекты</name>
      <description>Проекты</description>
    </items>
    <items>
      <name>ПроцессыИЗадачи</name>
      <description>Процессы и задачи</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ДО_для_разработки/src/Catalogs/ДелегированиеПрав/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает список делегирующих пользователей свои полномочия
// переданному в качестве параметра пользователю.
//
// Параметры:
//  Делегат - СправочникСсылка.Пользователи
//
// Возвращаемое значение:
//  Массив
//   * СправочникСсылка.Пользователи
//
Функция СписокДелегирующих(Делегат) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДелегированиеПрав.ОтКого
		|ИЗ
		|	Справочник.ДелегированиеПрав КАК ДелегированиеПрав
		|ГДЕ
		|	ДелегированиеПрав.Кому = &Пользователь
		|	И ДелегированиеПрав.Действует = ИСТИНА";
		
	Запрос.УстановитьПараметр("Пользователь", Делегат);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОтКого");
	
КонецФункции

// Возвращает список делегатов для уведомления по подписчику на событие.
//
// Параметры:
//  Подписчик - СправочникСсылка.Пользователь - Исходный подписчик на уведомление.
//  Объект - Произвольный - Объект, делегирование по которому учитывается.
// 
// Возвращаемое значение:
//  Массив - Делегаты подписчика для уведомления.
//
Функция ПолучитьДелегатовДляУведомления(Подписчик, Объект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДелегированиеПрав.Кому
		|ИЗ
		|	Справочник.ДелегированиеПрав КАК ДелегированиеПрав
		|ГДЕ
		|	ДелегированиеПрав.ОтКого = &Подписчик
		|	И ДелегированиеПрав.Действует
		|	И ДелегированиеПрав.ВариантДелегирования = ЗНАЧЕНИЕ(Перечисление.ВариантыДелегированияПрав.ВсеПрава)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДелегированиеПрав.Кому
		|ИЗ
		|	Справочник.ДелегированиеПрав.ОбластиДелегирования КАК ДелегированиеПравОбластиДелегирования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбластиДелегированияПрав.Состав КАК ОбластиДелегированияПравСостав
		|		ПО ДелегированиеПравОбластиДелегирования.ОбластьДелегирования = ОбластиДелегированияПравСостав.Ссылка
		|			И (ОбластиДелегированияПравСостав.ОбъектМетаданных = &ИдентификаторОбъектаМетаданных)
		|			И (НЕ ОбластиДелегированияПравСостав.Ссылка.ПометкаУдаления)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДелегированиеПрав КАК ДелегированиеПрав
		|		ПО ДелегированиеПравОбластиДелегирования.Ссылка = ДелегированиеПрав.Ссылка
		|ГДЕ
		|	ДелегированиеПрав.ОтКого = &Подписчик
		|	И ДелегированиеПрав.Действует
		|	И ДелегированиеПрав.ВариантДелегирования = ЗНАЧЕНИЕ(Перечисление.ВариантыДелегированияПрав.Выборочно)";
	
	Запрос.УстановитьПараметр("Подписчик", Подписчик);
	
	Если Объект <> Неопределено Тогда
		ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Объект.Метаданные());
	Иначе
		ИдентификаторОбъектаМетаданных = Неопределено;
	КонецЕсли;
	Запрос.УстановитьПараметр("ИдентификаторОбъектаМетаданных", ИдентификаторОбъектаМетаданных);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Кому");
	
КонецФункции

#КонецОбласти

#КонецЕсли
